In [3]:
import numpy as np
import pandas as pd

# Pandas were built over NumPy

In [2]:
# Series 1D labelled array
# DataFrame 2D labelled array

info = {
    "name" : ["Daisy", "Initha", "Joshini"],
    "CGPA" : [9.5,9.8,9.9]
}

df = pd.DataFrame(info)
print(df)

      name  CGPA
0    Daisy   9.5
1   Initha   9.8
2  Joshini   9.9

In [3]:
df # table mannered outcome

      name  CGPA
0    Daisy   9.5
1   Initha   9.8
2  Joshini   9.9

In [6]:
# Series 

s = pd.Series([1,2,3,4,5,6])
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
# Index based access
print(s[0])
print(s[1])

1
2

In [12]:
# label based access
s = pd.Series([20,21,22,23,24], index = ["Alice","Berlin","Catherin","Daisy","Evangelin"])
print(s)

print(s["Daisy"])
print(s["Alice"])

Alice        20
Berlin       21
Catherin     22
Daisy        23
Evangelin    24
dtype: int64
23
20

In [14]:
# Series Properties

# Pandas series are homogeneous.
s = pd.Series([20,21,22,23,24], index = ["Alice","Berlin","Catherin","Daisy","Evangelin"])
print(s) # dtype integer

s = pd.Series([20,21,22,23,24,"hello"], index = ["Alice","Berlin","Catherin","Daisy","Evangelin",25])
print(s) # dtype object

Alice        20
Berlin       21
Catherin     22
Daisy        23
Evangelin    24
dtype: int64
Alice           20
Berlin          21
Catherin        22
Daisy           23
Evangelin       24
25           hello
dtype: object

In [19]:
# Numpy vectorized operations can be applied in pandas aswell
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
print(s1+s2)

# Elements in pandas series are mutable
s1[1] = 100
# Size is immutable
changed_s1 = s1.drop(0)
print(s1)
print(changed_s1)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0      1
1    100
2      3
3      4
4      5
dtype: int64
1    100
2      3
3      4
4      5
dtype: int64

In [32]:
# DataFrame

# Creating dataframe - I (dictionary)
info = {
    "Name" : ["Alice","Berlin","Catherin"],
    "Age" : [20,20,20],
    "GPA" : [9.5,8.6,7.2]
}

df = pd.DataFrame(info)
print(df)
print(type(df))

# Indices 
print(df.index)

# Column names
print(df.columns)

       Name  Age  GPA
0     Alice   20  9.5
1    Berlin   20  8.6
2  Catherin   20  7.2
<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'GPA'], dtype='object')

In [4]:
# Creating dataframe - II (Nested lists)
df = pd.DataFrame([["Alice",23],["Berlin",22],["Catherin",24]],columns=["Name","Age"])
print(df)

# Creating dataframe - III (NumPy)
np_arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr,columns = ["A","B","C"])
print(df)

       Name  Age
0     Alice   23
1    Berlin   22
2  Catherin   24
   A  B  C
0  1  2  3
1  4  5  6

In [6]:
# selecting data
info = {
    "Name" : ["Alice","Berlin","Catherin"],
    "Age" : [20,20,20],
    "GPA" : [9.5,8.6,7.2]
}

df = pd.DataFrame(info)
print(df)

df["Name"]
df[["Name","Age"]]

# columns
df.columns

       Name  Age  GPA
0     Alice   20  9.5
1    Berlin   20  8.6
2  Catherin   20  7.2

Index(['Name', 'Age', 'GPA'], dtype='object')

In [16]:
# select Rows (loc - location)

print(df.loc[0])
print(df.loc[0:2]) # start idx : end idx (inclusive)

# select Row (iloc - index location)
print(df.iloc[0:2]) # start idx : end idx (exclusive)

# Individual Cells data
df.loc[0,"Name"]
df.loc[0,["Name","GPA"]]

# iloc will throw an error if we mention columns using string literals
df.iloc[0,0] # oth row 0th column's data

Name    Alice
Age        20
GPA       9.5
Name: 0, dtype: object
       Name  Age  GPA
0     Alice   20  9.5
1    Berlin   20  8.6
2  Catherin   20  7.2
     Name  Age  GPA
0   Alice   20  9.5
1  Berlin   20  8.6

'Alice'

In [21]:
# Selecting single scalar value - at & iat
print(df.at[0,"Name"])
print(df.iat[0,2])

Alice
9.5

In [37]:
# Filtering Data

df = pd.read_csv("csv-json-handling/raw_data.csv")

 # using relational operator
df[ df["income"] > 50000]
df[ (df["income"] > 50000) & (df["country"] == "USA")]

#printing specific data
df[ df["age"] > 25][["country","gender"]]

income_data = df[ (df["income"] > 50000) & (df["country"] == "USA")]
print(income_data)
print(income_data.iloc[0])

# why we don't go with loc - because there might be absence of particular label we put
# for instance - this will throw an error
# print(income_data.loc[2]) cause label 2 doesn't exist in income_data.

    id         name   age country  gender   income
0    1     John Doe  29.0     USA    Male  55000.0
1    1     John Doe  29.0     USA    Male  55000.0
8    8   Rachel Lee  29.0     USA  Female  62000.0
10  10  Emily Davis  31.0     USA     NaN  58000.0
id                1
name       John Doe
age            29.0
country         USA
gender         Male
income      55000.0
Name: 0, dtype: object

In [43]:
# filtering data using query method

df.query("income > 50000")
df.query("income > 50000 & gender == 'Male'")
df.query("income > 50000 & gender == 'Male'")[["name","age"]]

# using variables inside the query
income_range = 50000
df.query("income > @income_range")

    id         name   age country  gender   income
0    1     John Doe  29.0     USA    Male  55000.0
1    1     John Doe  29.0     USA    Male  55000.0
2    2   Jane Smith   NaN  Canada  Female  62000.0
5    5       Li Wei  27.0   China    Male  51000.0
6    6          NaN  45.0   India  Female  73000.0
7    7   Ahmed Khan  38.0     NaN    Male  68000.0
8    8   Rachel Lee  29.0     USA  Female  62000.0
10  10  Emily Davis  31.0     USA     NaN  58000.0

In [61]:
# Cleaning Data

# Handle Missing Values

df = pd.read_csv("csv-json-handling/raw_data.csv")

# isnull()
print(df.isnull()) # true - null, false - not null
# NaN - Not a Number

# isna() same as isnull()
print(df.isna())

# isnull().sum() to count the number of missing values in a column
print(df.isnull().sum())

# dropna() to drop all the null values from our dataset
print(df.dropna()) # row drop
print(df.dropna(axis = 1)) # col drop

# fillna() to fill the NaN 
print(df.fillna(0))

# real implementation
age_mean = df["age"].mean()
print(df["age"].fillna(age_mean))

# ffill - forward fill
df.ffill() # filling the NaN with previous cell data (forward)
# bfill - backward fill
df.bfill() # filling the NaN with previous cell data (backward)

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False
       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False
id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64
   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0
    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0
0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [71]:
# handling duplicates in the dataset

# duplicated()
print(df.duplicated())

# particular column
print(df["name"].duplicated())

df.drop_duplicates(inplace=True) # changes in the dataset aswell

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool
0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
Name: name, dtype: bool

In [78]:
# handling Data types and date-time

# to check the datatypes of the dataset
df.dtypes

# to change the existing datatype
df["age"].astype("float")

# to change the time

0     29.0
2      NaN
3      NaN
4     34.0
5     27.0
6     45.0
7     38.0
8     29.0
9      NaN
10    31.0
Name: age, dtype: float64